<?php
namespace SM\Util\Lunar;

trait LunarTrait
{
	public $dateCn          = ['初一', '初二', '初三', '初四', '初五', '初六', '初七', '初八', '初九', '初十', '十一', '十二', '十三', '十四', '十五', '十六', '十七', '十八', '十九', '二十', '廿一', '廿二', '廿三', '廿四', '廿五', '廿六', '廿七', '廿八', '廿九', '三十', '卅一'];
	public $monthCn         = ['十一', '腊', '正', '二', '三', '四', '五', '六', '七', '八', '九', '十'];
	public $termsCn         = ['冬至', '小寒', '大寒', '立春', '雨水', '惊蛰', '春分', '清明', '谷雨', '立夏', '小满', '芒种', '夏至', '小暑', '大暑', '立秋', '处暑', '白露', '秋分', '寒露', '霜降', '立冬', '小雪', '大雪'];
	public $heavenlyStems   = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];
	public $earthlyBranches = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];
	public $chineseZodiac   = ['鼠', '牛', '虎', '兔', '龙', '蛇', '马', '羊', '猴', '鸡', '狗', '猪'];
	
	public function unzip($str)
	{
		$z10 = '0000000000';
		$z20 = $z10 + $z10;
		
		$map = ['J' => '00', 'I' => '000', 'H' => '0000', 'G' => '00000', 't' => '01', 's' => '001', 'r' => '0001', 'q' => '00001', 'p' => '000001', 'o' => '0000001', 'n' => '00000001', 'm' => '000000001', 'l' => '0000000001', 'k' => '03', 'j' => '0303', 'i' => '003', 'h' => '003003', 'g' => '0003', 'f' => '00003', 'e' => '000003', 'd' => '0000003', 'c' => '00000003', 'b' => '000000003', 'a' => '0000000003', 'A' => $z20 + $z20 + $z20, 'B' => $z20 + $z20 + $z10, 'C' => $z20 + $z20, 'D' => $z20 + $z10, 'E' => $z20, 'F' => $z10];
		
		return preg_replace_callback('/\D/', function($match) use($map) {
			return $map[$match[0]];
		}, $str);
	}
	
	public function round($mjd)
	{
		return round($mjd, 0, $mjd < 0 ? PHP_ROUND_HALF_DOWN : PHP_ROUND_HALF_UP);
	}
}
